# St7SetPathLineThickness

Sets the thickness of the load path outlines.

long St7SetPathLineThickness(long uID, long Thickness)

Input Parameters

uID

Strand7 model file ID.

Strand7 API Manual

Thickness

The load path outline thickness in the range kMinThickness to kMaxThickness.